; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v12)
             (pred_3 ?v4 ?v11)
             (pred_11 ?v5 ?v11)
             (pred_1 ?v13 ?v5 )
	     (pred_6 ?v5)
             (pred_5 ?v8)
             (pred_4 ?v4)
             (pred_9 ?v11)
             (pred_12 ?v5)
             (pred_10 ?v4)
             (pred_7 ?v5)
             (pred_2 ))



(:action op_3
:parameters (?v6 ?v9 ?v1 ?v7)
:precondition (and (pred_5 ?v6) (pred_5 ?v9) (pred_4 ?v1) (pred_9 ?v7)
          (pred_8 ?v6 ?v9) (pred_3 ?v1 ?v7)
                   (pred_11 ?v9 ?v7) (pred_6 ?v6) 
                   (pred_12 ?v9) (pred_10 ?v1))
:effect (and  (pred_7 ?v9) (not (pred_12 ?v9))))


(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_5 ?v6) (pred_5 ?v3)
               (pred_6 ?v6) (pred_8 ?v6 ?v3) (pred_7 ?v3))
:effect (and (pred_6 ?v3) (not (pred_6 ?v6))))

(:action op_1
:parameters (?v6 ?v1)
:precondition (and (pred_5 ?v6) (pred_4 ?v1) 
                  (pred_6 ?v6) (pred_1 ?v1 ?v6) (pred_2 ))
:effect (and (pred_10 ?v1)
   (not (pred_1 ?v1 ?v6)) (not (pred_2 ))))


(:action op_5
:parameters (?v6 ?v2 ?v10)
:precondition (and (pred_5 ?v6) (pred_4 ?v2) (pred_4 ?v10)
                  (pred_6 ?v6) (pred_10 ?v10) (pred_1 ?v2 ?v6))
:effect (and (pred_10 ?v2) (pred_1 ?v10 ?v6)
        (not (pred_10 ?v10)) (not (pred_1 ?v2 ?v6))))

(:action op_2
:parameters (?v6 ?v1)
:precondition (and (pred_5 ?v6) (pred_4 ?v1) 
                  (pred_6 ?v6) (pred_10 ?v1))
:effect (and (pred_2 ) (pred_1 ?v1 ?v6) (not (pred_10 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_08 obj_11 obj_21 obj_31 obj_09 obj_30 obj_29 obj_32 obj_20 obj_22 obj_18 obj_10 obj_27 obj_04 obj_07 obj_14 obj_13 obj_03 obj_26 obj_12 obj_24 obj_05 obj_17 obj_15
    obj_19 obj_28 obj_06
    obj_25 obj_16 obj_02 obj_23
    )

    (:init
       (pred_2)

       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_11)
       (pred_5 obj_21)
       (pred_5 obj_31)
       (pred_5 obj_09)
       (pred_5 obj_30)
       (pred_5 obj_29)
       (pred_5 obj_32)
       (pred_5 obj_20)
       (pred_5 obj_22)
       (pred_5 obj_18)
       (pred_5 obj_10)
       (pred_5 obj_27)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_14)
       (pred_5 obj_13)
       (pred_5 obj_03)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_24)
       (pred_5 obj_05)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_9 obj_19)
       (pred_9 obj_28)
       (pred_9 obj_06)
       (pred_4 obj_25)
       (pred_4 obj_16)
       (pred_4 obj_02)
       (pred_4 obj_23)

       (pred_8 obj_01 obj_09)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_08 obj_30)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_11 obj_29)
       (pred_8 obj_11 obj_21)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_21 obj_32)
       (pred_8 obj_21 obj_31)
       (pred_8 obj_21 obj_11)
       (pred_8 obj_31 obj_20)
       (pred_8 obj_31 obj_21)
       (pred_8 obj_09 obj_22)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_30 obj_18)
       (pred_8 obj_30 obj_29)
       (pred_8 obj_30 obj_08)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_29 obj_32)
       (pred_8 obj_29 obj_11)
       (pred_8 obj_29 obj_30)
       (pred_8 obj_32 obj_27)
       (pred_8 obj_32 obj_20)
       (pred_8 obj_32 obj_21)
       (pred_8 obj_32 obj_29)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_20 obj_31)
       (pred_8 obj_20 obj_32)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_22 obj_09)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_30)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_10 obj_27)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_04)
       (pred_8 obj_27 obj_32)
       (pred_8 obj_27 obj_10)
       (pred_8 obj_04 obj_26)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_27)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_14 obj_24)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_03 obj_17)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_26 obj_04)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_12 obj_24)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_24 obj_14)
       (pred_8 obj_24 obj_12)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_03)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_17)
       (pred_12 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_08)
       (pred_11  obj_18 obj_19)
       (pred_11  obj_01 obj_28)
       (pred_11  obj_14 obj_06)
       (pred_11  obj_08 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_21)
       (pred_7 obj_31)
       (pred_7 obj_09)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_32)
       (pred_7 obj_20)
       (pred_7 obj_22)
       (pred_7 obj_10)
       (pred_7 obj_27)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_26)
       (pred_7 obj_12)
       (pred_7 obj_24)
       (pred_7 obj_05)
       (pred_7 obj_17)
       (pred_7 obj_15)

       (pred_3  obj_25 obj_19)
       (pred_3  obj_16 obj_28)
       (pred_3  obj_02 obj_06)
       (pred_3  obj_23 obj_28)
       (pred_1 obj_25 obj_31)
       (pred_1 obj_16 obj_24)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_23 obj_10)
       (pred_6 obj_30)
    )

    (:goal (and
       (pred_1 obj_02 obj_29)
       (pred_1 obj_23 obj_04)
    ))
(:constraints
  (always (not (pred_6 obj_03)))
)
)

; plan
1. (op_4 obj_30 obj_29)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_29)
   goals met: 0 of 2
2. (op_4 obj_29 obj_10)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_10)
   goals met: 0 of 2
3. (op_4 obj_10 obj_13)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_13)
   goals met: 0 of 2
4. (op_4 obj_13 obj_05)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_17)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_17)
   goals met: 0 of 2
6. (op_1 obj_17 obj_02)
   deleted: (pred_1 obj_02 obj_17) (pred_2)
   added: (pred_10 obj_02)
   goals met: 0 of 2
7. (op_4 obj_17 obj_05)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_05)
   goals met: 0 of 2
8. (op_4 obj_05 obj_13)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_13)
   goals met: 0 of 2
9. (op_4 obj_13 obj_10)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_10)
   goals met: 0 of 2
10. (op_4 obj_10 obj_29)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_29)
   goals met: 0 of 2
11. (op_2 obj_29 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_2) (pred_1 obj_02 obj_29)
   goals met: 1 of 2
12. (op_4 obj_29 obj_10)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_10)
   goals met: 1 of 2
13. (op_1 obj_10 obj_23)
   deleted: (pred_1 obj_23 obj_10) (pred_2)
   added: (pred_10 obj_23)
   goals met: 1 of 2
14. (op_4 obj_10 obj_27)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_27)
   goals met: 1 of 2
15. (op_4 obj_27 obj_04)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_04)
   goals met: 1 of 2
16. (op_2 obj_04 obj_23)
   deleted: (pred_10 obj_23)
   added: (pred_2) (pred_1 obj_23 obj_04)
   goals met: 2 of 2
